Documents/_Инвойс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>_Инвойс</Name>
			<BasedOn>
				<xr:Item>Document.ИнвойсЗакупки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтправкаИнвойсов</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоИнвойсам</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ОприходованиеНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.СкорректированныеИнвойсы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсУстановленВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументСкидки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_СкидкаПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаЗакупкиСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Распределить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_НомерИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииИнвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВКД_Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупкиСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаИнвойса</Name>
							<Comment>Цена в валюте инвойса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНаценкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/_ВзаиморасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>_ВзаиморасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВКД_ОприходованиеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВКД_ОприходованиеНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЦенаСоСкидкой</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Comment>(в долларах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/_Инвойс/Ext/ObjectModule.bsl
Процедура ПроверкаВозможностиПроведения(Отказ)

	

КонецПроцедуры
		   
Процедура ОбработкаПроведения(Отказ, Режим)
	
	ВалютаДоллар = ПараметрыСеанса.БазоваяВалюта;
	
	// Проверка: разрешен только один проведенный инвойс с товарами
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	_Инвойс.Ссылка КАК Инвойс
		             |ИЗ
		             |	Документ._Инвойс КАК _Инвойс
		             |ГДЕ
		             |	_Инвойс.Проведен
		             |	И _Инвойс.Ссылка <> &Ссылка
		             |	И _Инвойс.ДокументОснование = &ДокументОснование
		             |	И _Инвойс.ВидОперации = &ВидОперации";
	    Запр.УстановитьПараметр("ДокументОснование", ДокументОснование);
	    Запр.УстановитьПараметр("ВидОперации", ВидОперации);
	    Запр.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запр.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Сообщить(СтрШаблон(НСтр("ru = 'Уже есть инвойс (%1), созданный на основании текущего документа!'; en = 'There is already an invoice (%1) created based on the current document!'"), ВидОперации), СтатусСообщения.ОченьВажное);
			Отказ = Истина;	 
		КонецЕсли;
	КонецЕсли;
	
	// Проверка: затраты
	
	ЗапрЗатраты = Новый Запрос;
	ЗапрЗатраты.УстановитьПараметр("Ссылка", Ссылка);
	ЗапрЗатраты.Текст = "ВЫБРАТЬ
	                    |	ДвижениеДенегИнвойсы.Ссылка.Статья КАК Затрата,
	                    |	ДвижениеДенегИнвойсы.Ссылка КАК Документ,
	                    |	СУММА(ДвижениеДенегИнвойсы.Сумма) КАК Сумма,
	                    |	ДвижениеДенегИнвойсы.Ссылка.Валюта КАК Валюта
	                    |ИЗ
	                    |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
	                    |ГДЕ
	                    |	ДвижениеДенегИнвойсы.Инвойс = &Ссылка
	                    |	И ДвижениеДенегИнвойсы.Ссылка.Проведен
	            		|	И ДвижениеДенегИнвойсы.Ссылка.ВидДвиженияДенег = Значение(Перечисление.ВидДвиженияДенег.Логистика)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ДвижениеДенегИнвойсы.Ссылка.Статья,
	                    |	ДвижениеДенегИнвойсы.Ссылка,
	                    |	ДвижениеДенегИнвойсы.Ссылка.Валюта";
    РезультатЗапросаЗатраты = ЗапрЗатраты.Выполнить();      
	Если РезультатЗапросаЗатраты.Пустой() Тогда
		лЕстьЗатратыДвиженийДенег = Ложь;
	Иначе
	    лЕстьЗатратыДвиженийДенег = Истина;
	КонецЕсли;
	
	// Проверка: вес
	
	ЗапрТовары = Новый Запрос;
	ЗапрТовары.УстановитьПараметр("Ссылка", Ссылка);
	ЗапрТовары.Текст = "ВЫБРАТЬ
	                   |	ТЧ_Товары.Номенклатура КАК Номенклатура,
	                   |	ТЧ_Товары.Количество КАК Количество,
	                   |	ТЧ_Товары.Номенклатура.Вес КАК ВесНоменклатуры,
	                   |	ТЧ_Товары.Количество * ТЧ_Товары.Номенклатура.Вес КАК Вес,
	                   |	ТЧ_Товары.НомерСтроки КАК НомерСтроки
	                   |ИЗ
	                   |	Документ._Инвойс.ВКД_Товары КАК ТЧ_Товары
	                   |ГДЕ
	                   |	ТЧ_Товары.Ссылка = &Ссылка
	                   |	И ТЧ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)";
	ВыгрузкаТовары = ЗапрТовары.Выполнить().Выгрузить();
	Ошибки = Новый СписокЗначений;
	Для каждого СтрокаТЧ Из ВыгрузкаТовары Цикл
		Если СтрокаТЧ.ВесНоменклатуры = 0 Тогда
			Ошибки.Добавить(СтрокаТЧ.НомерСтроки);
		КонецЕсли;
	КонецЦикла;   
	лОбщийВес = ВыгрузкаТовары.Итог("Вес");
	Если лОбщийВес = 0 И (лЕстьЗатратыДвиженийДенег ИЛИ СуммаЗатрат > 0) Тогда
		//Отказ = Истина;
		//Сообщить("Общий вес нулевой! Распределение затрат невозможно");
		Сообщить("Вес товара не заполнен. Если будете распределять затраты на этот инвойс, не забудьте внести вес в карточке номенклатуры");
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// РН ВзаиморасчетыСПоставщиками  
	
	Движения._ВзаиморасчетыСПоставщиками.Записывать = Истина;
	Движение			 = Движения._ВзаиморасчетыСПоставщиками.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период		 = Дата;
	Движение.Контрагент	 = Контрагент;
	Движение.Инвойс		 = Ссылка;
	Движение.СуммаОплаты = Сумма;
	Если ЗначениеЗаполнено(ДокументОснование) И Курс = 1 Тогда
		Движение.Валюта	 = ДокументОснование.Валюта;
	Иначе	
		Движение.Валюта	 = Валюта;
	КонецЕсли;
	
	// РН ВКД_ОприходованиеНоменклатуры Приход  
	
	Движения.ВКД_ОприходованиеНоменклатуры.Записывать = Истина;
	Движения.ВКД_ОприходованиеНоменклатуры.Очистить();  
	Если Поставки.Количество() = 0 Тогда   
		
		// РН ОприходованиеНоменклатуры (одна поставка):
		
		Для Каждого ТекСтрокаВКД_Товары Из ВКД_Товары Цикл
			Если ТекСтрокаВКД_Товары.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
				Продолжить;	
			КонецЕсли;
			Движение = Движения.ВКД_ОприходованиеНоменклатуры.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			Движение.Документ 		= Ссылка;
			Движение.Номенклатура 	= ТекСтрокаВКД_Товары.Номенклатура; 
			Движение.Поставка		= 0;
			Движение.СуммаЗакупки 	= ТекСтрокаВКД_Товары.СуммаЗакупки; // в долларах  			
			Движение.Количество 	= ТекСтрокаВКД_Товары.Количество;
			Движение.СуммаСоСкидкой = ТекСтрокаВКД_Товары.СуммаЗакупкиСоСкидкой;
			Движение.ЦенаЗакупки 	= ТекСтрокаВКД_Товары.ЦенаЗакупки;  // в долларах
			Движение.ЦенаСоСкидкой 	= ТекСтрокаВКД_Товары.ЦенаСоСкидкой;
		КонецЦикла;
		
	Иначе
	   	// © Primus1C  05.10.2023  НАЧАЛО ►
		
		// РН ОприходованиеНоменклатуры (несколько поставок):
		
		Для каждого ТекПоставка Из Поставки Цикл
			Если ТекПоставка.Количество = 0 Тогда
				Продолжить;	
			КонецЕсли;
			Если ТекПоставка.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
				Продолжить;	
			КонецЕсли;
			Движение = Движения.ВКД_ОприходованиеНоменклатуры.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Период 		= Дата;
			Движение.Документ 		= Ссылка;
			Движение.Номенклатура 	= ТекПоставка.Номенклатура;
			Движение.Поставка		= ТекПоставка.Поставка;
			Движение.Количество 	= ТекПоставка.Количество; 
			//Если ЗначениеЗаполнено(ДокументОснование) И ДокументОснование.Валюта = ВалютаДоллар Тогда
				Движение.СуммаЗакупки 	= ТекПоставка.Сумма;
				Движение.ЦенаЗакупки 	= ТекПоставка.Сумма / ТекПоставка.Количество;
			//Иначе
			//	Движение.СуммаЗакупки 	= ТекПоставка.Сумма / Курс ;
			//	Движение.ЦенаЗакупки 	= Движение.СуммаЗакупки / ТекПоставка.Количество;
			//КонецЕсли;
		КонецЦикла; 
		
		// сторнируем корректировки инвойсов 
		// (потому что движения будут регистрироваться не по Инвойсы+Корректировки, а по ТЧ Поставки тек.документа)
		ЗапрОприх = Новый Запрос;
		ЗапрОприх.Текст = "ВЫБРАТЬ
		                  |	ВКД_ОприходованиеНоменклатуры.Номенклатура,
		                  |	ВКД_ОприходованиеНоменклатуры.Поставка,
		                  |	-СУММА(ВКД_ОприходованиеНоменклатуры.Количество) КАК Количество,
		                  |	-СУММА(ВКД_ОприходованиеНоменклатуры.СуммаЗакупки) КАК СуммаЗакупки,
		                  |	-СУММА(ВКД_ОприходованиеНоменклатуры.СуммаСоСкидкой) КАК СуммаСоСкидкой,
		                  |	ИСТИНА КАК ЭтоСторно
		                  |ИЗ
		                  |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ВКД_ОприходованиеНоменклатуры
		                  |ГДЕ
		                  |	ВКД_ОприходованиеНоменклатуры.Регистратор ССЫЛКА Документ.КорректировкаИнвойса
		                  |	И ВКД_ОприходованиеНоменклатуры.Документ = &Инвойс
		                  |
		                  |СГРУППИРОВАТЬ ПО
		                  |	ВКД_ОприходованиеНоменклатуры.Номенклатура,
		                  |	ВКД_ОприходованиеНоменклатуры.Поставка";
		ЗапрОприх.УстановитьПараметр("Инвойс", Ссылка);
		ВыгрузкаОприх = ЗапрОприх.Выполнить().Выгрузить();
		
		Движения.ВКД_ОприходованиеНоменклатуры.Записывать = Истина;
		//Движения.ВКД_ОприходованиеНоменклатуры.Очистить();

		Для каждого СтрокаОприх Из ВыгрузкаОприх Цикл
			Движение = Движения.ВКД_ОприходованиеНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаОприх);
		   	Движение.Период = Дата;
			Движение.Документ = Ссылка;
		КонецЦикла;  
		
		//// РН СкорректированныеИнвойсы (1):
		//
		//// сторнируем корректировки инвойсов 
		//// (потому что движения будут регистрироваться не по Инвойсы+Корректировки, а по ТЧ Поставки тек.документа)
		//ЗапрСторно = Новый Запрос;
		//ЗапрСторно.Текст = "ВЫБРАТЬ
		//                   |	СкорректированныеИнвойсы.Номенклатура,
		//                   |	СкорректированныеИнвойсы.НомерСтрокиИнвойса,
		//                   |	СкорректированныеИнвойсы.ТипСтроки,
		//                   |	-СУММА(СкорректированныеИнвойсы.Количество) КАК Количество,
		//                   |	-СУММА(СкорректированныеИнвойсы.Сумма) КАК Сумма
		//                   |ИЗ
		//                   |	РегистрНакопления.СкорректированныеИнвойсы КАК СкорректированныеИнвойсы
		//                   |ГДЕ
		//                   |	СкорректированныеИнвойсы.Инвойс = &Инвойс
		//                   |	И СкорректированныеИнвойсы.Регистратор ССЫЛКА Документ.КорректировкаИнвойса
		//                   |
		//                   |СГРУППИРОВАТЬ ПО
		//                   |	СкорректированныеИнвойсы.Номенклатура,
		//                   |	СкорректированныеИнвойсы.НомерСтрокиИнвойса,
		//                   |	СкорректированныеИнвойсы.ТипСтроки";
		//ЗапрСторно.УстановитьПараметр("Инвойс", Ссылка);
		//ВыгрузкаСторно = ЗапрСторно.Выполнить().Выгрузить();

		//Движения.СкорректированныеИнвойсы.Записывать = Истина;
		//Движения.СкорректированныеИнвойсы.Очистить();

		//Для каждого СтрокаСторно Из ВыгрузкаСторно Цикл
		//	Движение = Движения.СкорректированныеИнвойсы.Добавить();
		//	ЗаполнитьЗначенияСвойств(Движение, СтрокаСторно);
		//   	Движение.Период = Дата;
		//	Движение.Инвойс = Ссылка;
		//КонецЦикла;  
		
		// © Primus1C  ОКОНЧАНИЕ ◄ 
		
	КонецЕсли;
	
	// © Primus1C  25.06.2023  НАЧАЛО ► 
	
	// РН СкорректированныеИнвойсы (2):
	
	лТолькоУслуги = Истина;
	Движения.СкорректированныеИнвойсы.Записывать = Истина;
	//Движения.СкорректированныеИнвойсы.Очистить();
	Для Каждого ТекСтрокаВКД_Товары Из ВКД_Товары Цикл
		Движение = Движения.СкорректированныеИнвойсы.Добавить(); 
		Движение.Период				= Дата;
        Движение.Инвойс				= Ссылка;
		Движение.Номенклатура		= ТекСтрокаВКД_Товары.Номенклатура;
		Движение.ТипСтроки			= Перечисления.ТипыСтрокИнвойса.ВходитВИнвойс;
		Движение.Количество			= ТекСтрокаВКД_Товары.Количество;
		Движение.Сумма				= ТекСтрокаВКД_Товары.СуммаЗакупки;
		//Движение.НомерСтрокиИнвойса	= ТекСтрокаВКД_Товары.НомерСтроки;
		Движение.НомерСтрокиИнвойса	= ТекСтрокаВКД_Товары.ИдСтроки;
		Если ТекСтрокаВКД_Товары.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			лТолькоУслуги = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// РН ОтправкаИнвойсов:
	
	Движения.ОтправкаИнвойсов.Очистить(); 
	Движения.ОтправкаИнвойсов.Записывать = Истина;
		
	Если НЕ лТолькоУслуги Тогда
		
		Если Поставки.Количество() = 0 Тогда   // кол-во и сумму НЕ вносим в РН, поскольку их могут изменить КорректировкиИнвойсов
		
			Движение = Движения.ОтправкаИнвойсов.Добавить(); 
			Движение.Период				= Дата;
			Движение.Инвойс 			= Ссылка;
			//Движение.Количество			= ВКД_Товары.Итог("Количество");
			//Движение.Сумма     			= ВКД_Товары.Итог("СуммаЗакупки");
		    Движение.Поставка			= 0; 
			Движение.ОжидаемыеПоставки 	= 1;
			
		Иначе // кол-во и сумму вносим в РН, т.к. КорректировкиИнвойсов уже учтены при распределении по поставкам 
		
			Запр = Новый Запрос; 
			Запр.УстановитьПараметр("Ссылка", Ссылка);
			Запр.Текст = "ВЫБРАТЬ
			             |	СУММА(ИнвойсПоставки.Количество) КАК Количество,
			             |	СУММА(ИнвойсПоставки.Сумма) КАК Сумма,
			             |	ИнвойсПоставки.Поставка КАК Поставка,
			             |	1 КАК ОжидаемыеПоставки
			             |ИЗ
			             |	Документ._Инвойс.Поставки КАК ИнвойсПоставки
			             |ГДЕ
			             |	ИнвойсПоставки.Ссылка = &Ссылка
			             |
			             |СГРУППИРОВАТЬ ПО
			             |	ИнвойсПоставки.Поставка
			             |
			             |УПОРЯДОЧИТЬ ПО
			             |	Поставка";
			Выборка = Запр.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Движение = Движения.ОтправкаИнвойсов.Добавить(); 
				Движение.Период	= Дата;
				Движение.Инвойс = Ссылка;
				ЗаполнитьЗначенияСвойств(Движение, Выборка);	
			КонецЦикла;
		
		КонецЕсли;
	
	КонецЕсли;

	//ОбщегоНазначенияСервер.ЗаписатьСостояниеИнвойса(Ссылка); 
	
	
	// РН PасчетыПоИнвойсам

	Движения.РасчетыПоИнвойсам.Записывать = Истина;	 
	Если Контрагент.ПривязыватьИнвойсы Тогда
		Движение				= Движения.РасчетыПоИнвойсам.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход; 
		Движение.Период		 	= Дата;
		Движение.Инвойс			= Ссылка;  
		Движение.Контрагент		= Контрагент;
		Движение.Сумма			= СуммаВВалютеИнвойса; 
        Движение.СуммаОплаты	= ВКД_Товары.Итог("СуммаЗакупки");
		Движение.Валюта			= РаботаСИнвойсами.ВалютаИнвойса(Ссылка);
		Движение.Курс			= Курс;
	КонецЕсли;
	
	// РС Затраты
	
	НаборЗаписей = Движения.Затраты;

	//ЗапрЗатраты = Новый Запрос;
	//ЗапрЗатраты.УстановитьПараметр("Ссылка", Ссылка);
	//ЗапрЗатраты.Текст = "ВЫБРАТЬ
	//                    |	ДвижениеДенегИнвойсы.Затрата КАК Затрата,
	//                    |	ДвижениеДенегИнвойсы.Ссылка КАК Документ,
	//                    |	ДвижениеДенегИнвойсы.Сумма КАК Сумма,
	//                    |	ДвижениеДенегИнвойсы.Ссылка.Валюта КАК Валюта
	//                    |ИЗ
	//                    |	Документ.ДвижениеДенег.Инвойсы КАК ДвижениеДенегИнвойсы
	//                    |ГДЕ
	//                    |	ДвижениеДенегИнвойсы.Инвойс = &Ссылка
	//                    |	И ДвижениеДенегИнвойсы.Ссылка.Проведен
	//                    |ИТОГИ
	//                    |	СУММА(Сумма)
	//                    |ПО
	//                    |	Затрата,
	//                    |	Документ,
	//                    |	Валюта";
	//РезультатЗапросаЗатраты = ЗапрЗатраты.Выполнить();      
	
	МассивРаспределения = Новый Массив;
	Если лЕстьЗатратыДвиженийДенег = Ложь И СуммаЗатрат = 0 Тогда

		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		Возврат;
		
	ИначеЕсли лЕстьЗатратыДвиженийДенег Тогда
		
		ТаблицаЗатрат = РезультатЗапросаЗатраты.Выгрузить();
		Для каждого СтрокаЗатрат Из ТаблицаЗатрат Цикл
			МассивРаспределения.Добавить(Новый Структура("Затрата,Документ,Сумма,Валюта", 
													СтрокаЗатрат.Затрата,
		                                            СтрокаЗатрат.Документ,
		                                            СтрокаЗатрат.Сумма,
													СтрокаЗатрат.Валюта));
		КонецЦикла;
		
	Иначе
		
		МассивРаспределения.Добавить(Новый Структура("Затрата,Документ,Сумма,Валюта", 
													Справочники.Номенклатура.ЗатратыИнвойсов,
		                                            Ссылка,
		                                            СуммаЗатрат,
													Валюта));
		
	КонецЕсли;
	
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Ссылка", Ссылка);
	Если КоличествоПоставок > 1 Тогда
		Запр.Текст = "ВЫБРАТЬ
		             |	ТЧПоставки.Номенклатура КАК Номенклатура,
		             |	СУММА(ТЧПоставки.Количество) КАК Количество,
		             |	СУММА(ТЧПоставки.Номенклатура.Вес * ТЧПоставки.Количество) КАК Вес,
		             |	ТЧПоставки.Поставка КАК Поставка
		             |ИЗ
		             |	Документ._Инвойс.Поставки КАК ТЧПоставки
		             |ГДЕ
		             |	ТЧПоставки.Ссылка = &Ссылка
		             |	И ТЧПоставки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) 
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ТЧПоставки.Номенклатура,
		             |	ТЧПоставки.Поставка";
	Иначе
		Запр.Текст = "ВЫБРАТЬ
		             |	ТЧТовары.Номенклатура КАК Номенклатура,
		             |	СУММА(ТЧТовары.Количество) КАК Количество,
		             |	СУММА(ТЧТовары.Номенклатура.Вес * ТЧТовары.Количество) КАК Вес,
		             |	0 КАК Поставка
		             |ИЗ
		             |	Документ._Инвойс.ВКД_Товары КАК ТЧТовары
		             |ГДЕ
		             |	ТЧТовары.Ссылка = &Ссылка 
					 |	И ТЧТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ТЧТовары.Номенклатура";
	КонецЕсли;
	Выборка = Запр.Выполнить().Выбрать();
	
	Для каждого ДанныеРаспределения Из МассивРаспределения Цикл
		
		Выборка.Сбросить();
		Пока Выборка.Следующий() Цикл 
			лСуммаЗатрат = Выборка.Вес / лОбщийВес / Выборка.Количество * ДанныеРаспределения.Сумма;
			Если лСуммаЗатрат >= 0.000005 Тогда
				НовЗапись = НаборЗаписей.Добавить(); 
				НовЗапись.Период 		= Дата;
				НовЗапись.Источник 		= ДанныеРаспределения.Документ; 
				НовЗапись.Номенклатура 	= Выборка.Номенклатура;
				НовЗапись.Инвойс 		= Ссылка;   
				НовЗапись.Поставка		= Выборка.Поставка;   
				НовЗапись.Количество	= Выборка.Количество; 
				//НовЗапись.Сумма 		= Выборка.Вес / лОбщийВес * ДанныеРаспределения.Сумма; 
                НовЗапись.Сумма 		= лСуммаЗатрат;
				НовЗапись.СуммаВБазВалюте = РаботаСВалютой.Пересчитать2025(лСуммаЗатрат, ДанныеРаспределения.Валюта, ПараметрыСеанса.БазоваяВалюта, Фирма, Дата); 
				НовЗапись.Валюта 		= ДанныеРаспределения.Валюта; 
				НовЗапись.Затрата		= ДанныеРаспределения.Затрата;
				НовЗапись.Зарегистрировано = ТекущаяДата();
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
	
	КонецЦикла;
	
	// РС ДокументыКПроведению

	// 1. Создаем набор записей нужного регистра
	НаборЗаписей = РегистрыСведений.ДокументыКПроведению.СоздатьНаборЗаписей();
	
	// 2. Устанавливаем отбор по ведущему измерению.
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	
	// 3. Записываем ПУСТОЙ набор. 
	// Метод Записать() по умолчанию замещает данные. 
	// Так как мы ничего не добавили в НаборЗаписей, старые данные стираются.
	НаборЗаписей.Записать();
	
	// РС СостоянияИнвойсов
	
	//
	// ПРОДОЛЖИТЬ ЗДЕСЬ
	//
	
	//ОплаченоПоИнвойсу = омСервер.ОплаченоПоставщикуПоИнвойсу(Ссылка, );
	
	
	ВОЗВРАТ;
	/////////////////////////////////////////////////////////////////////////////////////////
	
	
	
	
	
	
	
	
	НаборЗаписей = Движения.Затраты;
	Если СуммаЗатрат = 0 Тогда

		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		
	Иначе	

		лВес = 0;        
		Ошибки = Новый СписокЗначений;
		Для каждого СтрокаТЧ Из ВКД_Товары Цикл
			Если СтрокаТЧ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар И СтрокаТЧ.Номенклатура.Вес = 0 Тогда
				Ошибки.Добавить(СтрокаТЧ.НомерСтроки);
			КонецЕсли;
			лВес = лВес + СтрокаТЧ.Номенклатура.Вес * СтрокаТЧ.Количество;
		КонецЦикла;
		Если лВес = 0 Тогда
		    Отказ = Истина;
			Сообщить("Общий вес нулевой! Распределение затрат невозможно");	
			Возврат;
		КонецЕсли;

		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Если КоличествоПоставок > 1 Тогда
			Запр.Текст = "ВЫБРАТЬ
			             |	ТЧПоставки.Номенклатура КАК Номенклатура,
			             |	СУММА(ТЧПоставки.Количество) КАК Количество,
			             |	СУММА(ТЧПоставки.Номенклатура.Вес * ТЧПоставки.Количество) КАК Вес,
			             |	ТЧПоставки.Поставка КАК Поставка
			             |ИЗ
			             |	Документ._Инвойс.Поставки КАК ТЧПоставки
			             |ГДЕ
			             |	ТЧПоставки.Ссылка = &Ссылка
			             |	И ТЧПоставки.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) 
			             |
			             |СГРУППИРОВАТЬ ПО
			             |	ТЧПоставки.Номенклатура,
			             |	ТЧПоставки.Поставка";
		Иначе
			Запр.Текст = "ВЫБРАТЬ
			             |	ТЧТовары.Номенклатура КАК Номенклатура,
			             |	СУММА(ТЧТовары.Количество) КАК Количество,
			             |	СУММА(ТЧТовары.Номенклатура.Вес * ТЧТовары.Количество) КАК Вес,
			             |	0 КАК Поставка
			             |ИЗ
			             |	Документ._Инвойс.ВКД_Товары КАК ТЧТовары
			             |ГДЕ
			             |	ТЧТовары.Ссылка = &Ссылка 
						 |	И ТЧТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
			             |
			             |СГРУППИРОВАТЬ ПО
			             |	ТЧТовары.Номенклатура";
		КонецЕсли;
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НовЗапись = НаборЗаписей.Добавить(); 
			НовЗапись.Период 		= Дата;
			НовЗапись.Источник 		= Ссылка; 
			НовЗапись.Номенклатура 	= Выборка.Номенклатура;
			НовЗапись.Инвойс 		= Ссылка;   
			НовЗапись.Поставка		= Выборка.Поставка;   
			НовЗапись.Количество	= Выборка.Количество; 
			НовЗапись.Сумма 		= Выборка.Вес / лВес / Выборка.Количество * СуммаЗатрат;
			НовЗапись.Валюта 		= Валюта; 
			НовЗапись.Затрата		= Справочники.Номенклатура.ЗатратыИнвойсов;
			НовЗапись.Зарегистрировано = ТекущаяДата();
		КонецЦикла;
		НаборЗаписей.Записать(Истина);
		
		Если Ошибки.Количество() > 0 Тогда
			Сообщить(СтрШаблон("%1: %2",
							НСтр("ru = 'Неверно распределены затраты! Не установлен вес номенклатуры: строка(и)'; en = 'Incorrectly allocated costs! Good weight not set: line(s)'"),
							Ошибки));	
		КонецЕсли;
		
	КонецЕсли;
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// © Primus1C  28.09.2023  НАЧАЛО ►      
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	 
	
	ЕстьЗатраты = СуммаЗатрат > 0;
	
	// установим вид операции
	лНомДоставка 	= Константы.НоменклатураУслугаДоставки.Получить();
	лНомСкидка 		= Константы.НоменклатураСкидка.Получить();
	КоличествоПоставок  = 0;
	СуммаВВалютеИнвойса = 0;  
	лТолькоТовары 		= Истина;
	ТолькоУслуги 		= Истина;  
	лЕстьДоставка 		= Неопределено;
	лЕстьСкидка 		= Неопределено;
	Для каждого Товар Из ВКД_Товары Цикл
		СуммаВВалютеИнвойса = СуммаВВалютеИнвойса + Товар.Количество * ?(Товар.ЦенаИнвойса=0, Товар.ЦенаЗакупки, Товар.ЦенаИнвойса);   
		Если Товар.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда 
			лТолькоТовары = Ложь;
		Иначе	
			ТолькоУслуги = Ложь;
		КонецЕсли;   
		Если Товар.Номенклатура = лНомДоставка Тогда
			лЕстьДоставка = Истина;
		ИначеЕсли Товар.Номенклатура = лНомСкидка Тогда	
		    лЕстьСкидка = Истина;
		КонецЕсли;
	КонецЦикла; 
	Если лТолькоТовары Тогда		
		ВидОперации = Перечисления.ВидыОперацииИнвойс.Товар;  
	ИначеЕсли ТолькоУслуги Тогда 
		Если лЕстьДоставка = Истина Тогда
			ВидОперации = Перечисления.ВидыОперацииИнвойс.Доставка;
		ИначеЕсли лЕстьСкидка = Истина Тогда
			ВидОперации = Перечисления.ВидыОперацииИнвойс.Скидка;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//КоличествоПоставок = 1;
		Для Каждого Пост Из Поставки Цикл
			КоличествоПоставок = Макс(КоличествоПоставок, Пост.Поставка);                
		КонецЦикла;      
	//Иначе
	//	КоличествоПоставок = 0;
	КонецЕсли;  
	
	
	// Пересчет цен закупки в Прих и Расх Накладных
	
	Если ЦеныБылиИзменены() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Запр.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
		Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		             |	ВКД_ОприходованиеНоменклатуры.Регистратор КАК ПриходнаяНакладная
		             |ИЗ
		             |	РегистрНакопления.ВКД_ОприходованиеНоменклатуры КАК ВКД_ОприходованиеНоменклатуры
		             |ГДЕ
		             |	ВКД_ОприходованиеНоменклатуры.Документ = &Ссылка
		             |	И ВКД_ОприходованиеНоменклатуры.ВидДвижения = &ВидДвижения
		             |	И ВКД_ОприходованиеНоменклатуры.Регистратор ССЫЛКА Документ.ПриходнаяНакладная";
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбработкаДокументов.ЗарегистрироватьДокументКПроведению(Выборка.ПриходнаяНакладная, Ссылка);
			// а запись прих.накладных с новыми ценами инициирует регистрацию к проведению зависимых расх.накладных и возвратов покупателя
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);	

	// © Primus1C  ОКОНЧАНИЕ ◄
	
	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	
КонецПроцедуры      


// © Primus1C  24.06.2023  НАЧАЛО ►

&НаСервере
Функция ЦеныБылиИзменены()

	// 1. Если документ создается впервые
	Если ЭтоНовый() Тогда
		// Любая непустая табличная часть считается изменением (строки были добавлены)
		Возврат ВКД_Товары.Количество() > 0;
	КонецЕсли;
	
	// 2. Быстрая проверка: если количество строк изменилось, 
	// значит было удаление или добавление
	Если ВКД_Товары.Количество() <> Ссылка.ВКД_Товары.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	// 3. Выгружаем колонки в таблицы значений для быстрого построчного сравнения
	// (Выгружать всю ТЧ не нужно, берем только нужное для экономии памяти)
	ТЗТекущие = ВКД_Товары.Выгрузить(, "НомерСтроки, Номенклатура, ЦенаЗакупки");
	ТЗВБазе   = Ссылка.ВКД_Товары.Выгрузить(, "НомерСтроки, Номенклатура, ЦенаЗакупки");
	
	// Индексируем колонку для моментального поиска внутри цикла
	ТЗВБазе.Индексы.Добавить("НомерСтроки");
	
	// 4. Проверяем каждую строку
	Для Каждого СтрТекущая Из ТЗТекущие Цикл
		
		СтрВБазе = ТЗВБазе.Найти(СтрТекущая.НомерСтроки, "НомерСтроки");
		
		// Если пользователь удалил строку в середине и добавил новую в конец,
		// общее количество совпадет, но номера строк разъедутся. Отлавливаем это:
		Если СтрВБазе = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
		
		// Главная проверка: изменилась ли сама цена
		Если СтрТекущая.ЦенаЗакупки <> СтрВБазе.ЦенаЗакупки ИЛИ СтрТекущая.Номенклатура <> СтрВБазе.Номенклатура Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если код дошел сюда, значит ни состав строк, ни цены не менялись
	Возврат Ложь;	

КонецФункции 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);
	Валюта = ПараметрыСеанса.БазоваяВалюта;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвойсЗакупки") Тогда
		 ЗаполнитьНаОснованииИнвойсаЗакупки(ДанныеЗаполнения)
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ИнвойсЗакупки") Тогда  
		 ЗаполнитьНаОснованииИнвойсаЗакупки(ДанныеЗаполнения.ДокументОснование, ДанныеЗаполнения.ВидОперации)
	Иначе	
	КонецЕсли; 
	
	КурсУстановленВручную = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииИнвойсаЗакупки(ДанныеЗаполнения, ЗаполнениеВидОперации=Неопределено)
	
	ДокументОснование				= ДанныеЗаполнения.Ссылка; 
	ВидОперации						= ?(ЗаполнениеВидОперации=Неопределено, Перечисления.ВидыОперацииИнвойс.Товар, ЗаполнениеВидОперации);
	ПланируемаяДатаОплаты 			= ДанныеЗаполнения.ДатаОплаты; 
	Контрагент						= ДанныеЗаполнения.Контрагент;   
	Если Дата >= ОбщегоНазначенияПовтИсп.ПредустановленнаяДатаУчета("НачалоАвтоматическогоРасчетаКурсаИнвойсов") Тогда
		Валюта 						= ДанныеЗаполнения.Валюта;
	Иначе
		Валюта 						= ПараметрыСеанса.БазоваяВалюта;  
	КонецЕсли;
	ВКД_НомерИнвойсаПоставщика		= ДанныеЗаполнения.НомерИнвойсаПоставщика;	
	ВКД_ДатаИнвойсаПоставщика		= ДанныеЗаполнения.ДатаИнвойсаПоставщика; 
	//Если ДанныеЗаполнения.Валюта = ПараметрыСеанса.БазоваяВалюта Тогда
	//	Курс = 1;  
	//Иначе 
	//	Если ДанныеЗаполнения.Оплаты.Количество() > 0 Тогда
	//		Курс 					= ДанныеЗаполнения.Оплаты[0].Курс;
	//		ПланируемаяДатаОплаты 	= ДанныеЗаполнения.Оплаты[0].Дата;
	//	КонецЕсли;   
	//	Если Курс = 0 Тогда
	//		Курс 					= гоКурс(ДанныеЗаполнения.Валюта, Фирма, );
	//	КонецЕсли;
	//КонецЕсли;
	Курс = 1; 
	
	Если ВидОперации = Перечисления.ВидыОперацииИнвойс.Доставка Тогда
		НовСтрока = ВКД_Товары.Добавить();
		НовСтрока.Номенклатура = Константы.НоменклатураУслугаДоставки.Получить();
	    НовСтрока.Количество = 1;
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацииИнвойс.Скидка Тогда
		НовСтрока = ВКД_Товары.Добавить();
		НовСтрока.Номенклатура = Константы.НоменклатураСкидка.Получить();
	    НовСтрока.Количество = 1;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//// удалим записи о состоянии инвойса 
	//НаборЗаписей = РегистрыСведений.СостоянияИнвойсов.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Инвойс.Установить(Ссылка);
	//НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	РаботаСИнвойсами.ЗаписатьРасхожденияИнвойса(Ссылка);    
	
	Если Контрагент.ПривязыватьИнвойсы Тогда
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Состояние = РаботаСИнвойсами.СостояниеОплатыИнвойса(Ссылка, Ссылка, ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение);
			РаботаСИнвойсами.ЗаписатьСтатусыИнвойса(Ссылка,,,,Состояние.СтатусОплатыАвто, Состояние.СуммаОплаты, Состояние.ДатаОплаты, Состояние.Курс, Ссылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
